data/Parm_PH_29/alpha_125/alpha_125/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0436208700241417 1.00195550328779 0)
(0.130863025199997 1.00153924448973 4.13638459999446e-18)
(0.218018288436099 0.99806921552198 0)
(0.304594336436904 0.987925562586492 -8.48480018323489e-18)
(0.389496801662928 0.968529748206879 0)
(0.471450732276194 0.939031936356126 -2.03576195201216e-18)
(0.550062449290201 0.901352975247831 -9.4639141841326e-20)
(0.625887499595772 0.858282833219879 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0436249887810028 1 0)
(0.130869601664259 0.999582980550575 0)
(0.217996458054385 0.996109056920152 0)
(0.304524473058388 0.985958550270882 0)
(0.389361933067269 0.966557420214522 0)
(0.471253915372358 0.937049698864635 0)
(0.549822993047255 0.899338247560962 0)
(0.625618998145646 0.856211701787381 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.04151875 3.036 0)
(0.12455625 3.036 0)
(0.20759375 3.036 0)
(0.29063125 3.036 0)
(0.37366875 3.036 0)
(0.45670625 3.036 0)
(0.53974375 3.036 0)
(0.62278125 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
