data/Parm_PH_29/alpha_125/alpha_125/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00345958 -0.00002529 0.00000000 0.00000370 0.00000000 0.00198812)
(0.00469284 -0.00003681 0.00000000 0.00000667 0.00000000 0.00237225)
(0.00202124 0.00007169 0.00000000 -0.00002227 0.00000000 0.00090093)
(0.00144814 -0.00057000 0.00000000 0.00024822 0.00000000 0.00160821)
(0.00079339 -0.00061611 0.00000000 0.00037224 0.00000000 0.00220853)
(0.00053861 -0.00057690 0.00000000 0.00045398 0.00000000 0.00134937)
(0.00081730 -0.00014523 0.00000000 0.00001440 0.00000000 0.00121200)
(0.00230035 -0.00163066 0.00000000 0.00117815 0.00000000 0.00326298)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
