data/Parm_PH_29/alpha_125/alpha_125/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (0   1.0    -.1  )//0
        (9.9645   1.0    -.1  )//1
        (9.9645   2.0    -.1  )//2
        (0   2.0    -.1  )//3
        (0   1.0     .1  )//4
        (9.9645   1.0     .1  )//5
        (9.9645   2.0     .1  )//6
        (0   2.0     .1  )//7
        (9.9645   3.036  -.1  )//8
        (0   3.036  -.1  )//9
        (0   3.036   .1  )//10
        (9.9645   3.036   .1  )//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (120 65 1) simpleGrading (1 10 1)
        hex (3 2 8 9 7 6 11 10) (120 65 1) simpleGrading (1 .1 1)
);

/*
edges
(
      spline 0 1 ((0.25 -0.1 0.1))
      spline 3 2 ((0.75  0.1 0.1))
);
*/

//EDGES-START
edges
(
spline 0 1 (
(0 1 -0.1)
(0.0125 1 -0.1)
(0.025 1 -0.1)
(0.0375 1 -0.1)
(0.05 1 -0.1)
(0.0625 1 -0.1)
(0.075 1 -0.1)
(0.0875 1 -0.1)
(0.1 1 -0.1)
(0.1125 1 -0.1)
(0.125 1 -0.1)
(0.1375 1 -0.1)
(0.15 0.999853500361723 -0.1)
(0.1625 0.999546574964562 -0.1)
(0.175 0.999147670842287 -0.1)
(0.1875 0.998646794216239 -0.1)
(0.2 0.998033951307763 -0.1)
(0.2125 0.997299148338199 -0.1)
(0.225 0.996432391528892 -0.1)
(0.2375 0.995423687101183 -0.1)
(0.25 0.994263041276416 -0.1)
(0.2625 0.992940460275932 -0.1)
(0.275 0.991445950321075 -0.1)
(0.2875 0.989769517633187 -0.1)
(0.3 0.987901168433611 -0.1)
(0.3125 0.985830908943689 -0.1)
(0.325 0.983548745384765 -0.1)
(0.3375 0.98104468397818 -0.1)
(0.35 0.978308730945277 -0.1)
(0.3625 0.9753308925074 -0.1)
(0.375 0.97210117488589 -0.1)
(0.3875 0.968609584302091 -0.1)
(0.4 0.964846126977344 -0.1)
(0.4125 0.960802791061489 -0.1)
(0.425 0.956483795770945 -0.1)
(0.4375 0.951898021524438 -0.1)
(0.45 0.947054357916131 -0.1)
(0.4625 0.941961694540189 -0.1)
(0.475 0.936628920990776 -0.1)
(0.4875 0.931064926862056 -0.1)
(0.5 0.925278601748195 -0.1)
(0.5125 0.919278835243357 -0.1)
(0.525 0.913074516941706 -0.1)
(0.5375 0.906674536437407 -0.1)
(0.55 0.900087783324624 -0.1)
(0.5625 0.893323147197522 -0.1)
(0.575 0.886389517650265 -0.1)
(0.5875 0.879295784277018 -0.1)
(0.6 0.872050836671945 -0.1)
(0.6125 0.864663564429211 -0.1)
(0.625 0.857142857142802 -0.1)
(0.6375 0.849497397992501 -0.1)
(0.65 0.841735044498589 -0.1)
(0.6625 0.833863447766786 -0.1)
(0.675 0.825890258902813 -0.1)
(0.6875 0.81782312901239 -0.1)
(0.7 0.809669709201238 -0.1)
(0.7125 0.801437650575077 -0.1)
(0.725 0.793134604239629 -0.1)
(0.7375 0.784768221300614 -0.1)
(0.75 0.776346152863751 -0.1)
(0.7625 0.767876050034763 -0.1)
(0.775 0.75936556391937 -0.1)
(0.7875 0.750822345623292 -0.1)
(0.8 0.742254046252249 -0.1)
(0.8125 0.733668316911963 -0.1)
(0.825 0.725072808708154 -0.1)
(0.8375 0.716475172746543 -0.1)
(0.85 0.70788306013285 -0.1)
(0.8625 0.699304121972797 -0.1)
(0.875 0.690746009372103 -0.1)
(0.8875 0.682216373436488 -0.1)
(0.9 0.673722597050246 -0.1)
(0.9125 0.665267557822977 -0.1)
(0.925 0.656850395032062 -0.1)
(0.9375 0.648470134799476 -0.1)
(0.95 0.640125803247193 -0.1)
(0.9625 0.631816426497189 -0.1)
(0.975 0.623541030671437 -0.1)
(0.9875 0.615298641891911 -0.1)
(1 0.607088286280585 -0.1)
(1.0125 0.598908989959435 -0.1)
(1.025 0.590759779050434 -0.1)
(1.0375 0.582639679675556 -0.1)
(1.05 0.574547717956777 -0.1)
(1.0625 0.56648292001607 -0.1)
(1.075 0.558444311975409 -0.1)
(1.0875 0.550430919956769 -0.1)
(1.1 0.542441770082123 -0.1)
(1.1125 0.534475888473448 -0.1)
(1.125 0.526532301252716 -0.1)
(1.1375 0.518610034541902 -0.1)
(1.15 0.51070811446298 -0.1)
(1.1625 0.502825567137925 -0.1)
(1.175 0.494961418688711 -0.1)
(1.1875 0.487114695237311 -0.1)
(1.2 0.479284422905702 -0.1)
(1.2125 0.471469627815856 -0.1)
(1.225 0.463669336089748 -0.1)
(1.2375 0.455882573849353 -0.1)
...
)
spline 4 5 (
(0 1 0.1)
(0.0125 1 0.1)
(0.025 1 0.1)
(0.0375 1 0.1)
(0.05 1 0.1)
(0.0625 1 0.1)
(0.075 1 0.1)
(0.0875 1 0.1)
(0.1 1 0.1)
(0.1125 1 0.1)
(0.125 1 0.1)
(0.1375 1 0.1)
(0.15 0.999853500361723 0.1)
(0.1625 0.999546574964562 0.1)
(0.175 0.999147670842287 0.1)
(0.1875 0.998646794216239 0.1)
(0.2 0.998033951307763 0.1)
(0.2125 0.997299148338199 0.1)
(0.225 0.996432391528892 0.1)
(0.2375 0.995423687101183 0.1)
(0.25 0.994263041276416 0.1)
(0.2625 0.992940460275932 0.1)
(0.275 0.991445950321075 0.1)
(0.2875 0.989769517633187 0.1)
(0.3 0.987901168433611 0.1)
(0.3125 0.985830908943689 0.1)
(0.325 0.983548745384765 0.1)
(0.3375 0.98104468397818 0.1)
(0.35 0.978308730945277 0.1)
(0.3625 0.9753308925074 0.1)
(0.375 0.97210117488589 0.1)
(0.3875 0.968609584302091 0.1)
(0.4 0.964846126977344 0.1)
(0.4125 0.960802791061489 0.1)
(0.425 0.956483795770945 0.1)
(0.4375 0.951898021524438 0.1)
(0.45 0.947054357916131 0.1)
(0.4625 0.941961694540189 0.1)
(0.475 0.936628920990776 0.1)
(0.4875 0.931064926862056 0.1)
(0.5 0.925278601748195 0.1)
(0.5125 0.919278835243357 0.1)
(0.525 0.913074516941706 0.1)
(0.5375 0.906674536437407 0.1)
(0.55 0.900087783324624 0.1)
(0.5625 0.893323147197522 0.1)
(0.575 0.886389517650265 0.1)
(0.5875 0.879295784277018 0.1)
(0.6 0.872050836671945 0.1)
(0.6125 0.864663564429211 0.1)
(0.625 0.857142857142802 0.1)
(0.6375 0.849497397992501 0.1)
(0.65 0.841735044498589 0.1)
(0.6625 0.833863447766786 0.1)
(0.675 0.825890258902813 0.1)
(0.6875 0.81782312901239 0.1)
(0.7 0.809669709201238 0.1)
(0.7125 0.801437650575077 0.1)
(0.725 0.793134604239629 0.1)
(0.7375 0.784768221300614 0.1)
(0.75 0.776346152863751 0.1)
(0.7625 0.767876050034763 0.1)
(0.775 0.75936556391937 0.1)
(0.7875 0.750822345623292 0.1)
(0.8 0.742254046252249 0.1)
(0.8125 0.733668316911963 0.1)
(0.825 0.725072808708154 0.1)
(0.8375 0.716475172746543 0.1)
(0.85 0.70788306013285 0.1)
(0.8625 0.699304121972797 0.1)
(0.875 0.690746009372103 0.1)
(0.8875 0.682216373436488 0.1)
(0.9 0.673722597050246 0.1)
(0.9125 0.665267557822977 0.1)
(0.925 0.656850395032062 0.1)
(0.9375 0.648470134799476 0.1)
(0.95 0.640125803247193 0.1)
(0.9625 0.631816426497189 0.1)
(0.975 0.623541030671437 0.1)
(0.9875 0.615298641891911 0.1)
(1 0.607088286280585 0.1)
(1.0125 0.598908989959435 0.1)
(1.025 0.590759779050434 0.1)
(1.0375 0.582639679675556 0.1)
(1.05 0.574547717956777 0.1)
(1.0625 0.56648292001607 0.1)
(1.075 0.558444311975409 0.1)
(1.0875 0.550430919956769 0.1)
(1.1 0.542441770082123 0.1)
(1.1125 0.534475888473448 0.1)
(1.125 0.526532301252716 0.1)
(1.1375 0.518610034541902 0.1)
(1.15 0.51070811446298 0.1)
(1.1625 0.502825567137925 0.1)
(1.175 0.494961418688711 0.1)
(1.1875 0.487114695237311 0.1)
(1.2 0.479284422905702 0.1)
(1.2125 0.471469627815856 0.1)
(1.225 0.463669336089748 0.1)
(1.2375 0.455882573849353 0.1)
...
);
//EDGES-END
//EDGES-END
//EDGES-END


boundary
(
    bottomWall
    {
        type            wall;
        faces           ((4 0 1 5));
    }
    topWall
    {
        type            wall;
        faces           ((10 11 8 9));
    }

    inlet_half0
    {
        type            cyclic;
        neighbourPatch  outlet_half0;
        faces           ((7 3 0 4));
    }

    inlet_half1
    {
        type            cyclic;
        neighbourPatch  outlet_half1;
        faces           ((7 10 9 3));
    }

    outlet_half0
    {
        type            cyclic;
        neighbourPatch  inlet_half0;
        faces           ((6 5 1 2));
    }

    outlet_half1
    {
        type            cyclic;
        neighbourPatch  inlet_half1;
        faces           ((11 6 2 8));
    }

    sideRight_half0
    {
        type            empty;
        neighbourPatch  sideLeft_half0;
        faces           ((6 7 4 5));
    }

    sideRight_half1
    {
        type            empty;
        neighbourPatch  sideLeft_half1;
        faces           ((10 7 6 11));
    }

    sideLeft_half0
    {
        type            empty;
        neighbourPatch  sideRight_half0;
        faces           ((0 3 2 1));
    }

    sideLeft_half1
    {
        type            empty;
        neighbourPatch  sideRight_half1;
        faces           ((3 9 8 2));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
